Autodesk.Revit.DB.Structure.RebarSpliceOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarSpliceOptions.SpliceTypeId
Identifies the id of the Rebar Splice Type.
Remarks:
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided spliceTypeId is not a Rebar Splice Type id. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceOptions.SplicePosition
Identifies the splice line position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceOptions.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSplicePosition)
Constructs a RebarSpliceOptions
document:
The document.
spliceTypeId:
The splice type id.
splicePosition:
The splice line position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided spliceTypeId is not a Rebar Splice Type id. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceOptions
This class encapsulates the options for the rebar splice operation.
Since:
2025